Revit 2025 API
ExternalDBApplicationResult Enumeration
Informs Autodesk Revit of the status of your external db application after execution.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum ExternalDBApplicationResult
Public Enumeration ExternalDBApplicationResult
public enum class ExternalDBApplicationResult
type ExternalDBApplicationResult
Members
Member name | Value | Description
Succeeded | 0 | The external db application completed successfully. Autodesk Revit will keep this object during the entire Revit session.
Failed | -1 | The external db application was unable to complete its task.
See Also
Reference
Autodesk.Revit.DB Namespace